var cardNames =new Array("民兵","步兵","轻骑兵","重步兵","重骑兵","雇佣兵","骁勇骑","猎人","弓手","弩手","重弩手",
"骑兵射手","精锐骑兵射手","枪兵","长枪兵","精锐长枪兵","攻城车","投石车","单臂弩车","刺客","猛将","谋士","使节",
"智将","大儒","大祭司","巫","道士","城市升级","军事升级","防御工事","增兵防守","守城巨弩","修缮城墙","募兵令",
"广纳贤良","游闲神医","军医","募粮令","征讨令","袭营","斩将","冲阵","火攻","截获","离间","举贤","布阵","借兵",
"借粮","祈雨","巫鼓","黄巾力士","雷公助阵");
var cardEffects =new Array("造成1点伤害","造成2点伤害","造成3点伤害，损坏敌方2点金币","造成3点伤害",
"造成4点伤害，损坏敌方3点金币","造成1点伤害","造成6点伤害，损坏对方5点金币","造成2点伤害",
"造成1点伤害","造成3点伤害","造成4点伤害","造成2点伤害，损坏敌人1点人口","造成4点伤害，损坏敌人2点人口",
"造成1点伤害","造成2点伤害","造成3点伤害","对城市防御造成12点伤害","造成8点伤害，损坏敌方5点人口",
"造成7点伤害","去掉对面1个特殊角色","可以使用猛将卡 ","可以使用计谋卡","可以使用外交卡",
"可以使用智将卡","可以使用大儒卡","可以使用祭祀卡","可以使用巫术卡","可以使用道术卡","城市规模升级",
"军事规模升级","+3点城市防御","+3点城市防御","+7点城市防御","+5点城市防御","增加军事人口3点","随机给一张招募卡",
"+5点城主血量","+2点城主血量","增加5点金币","抽2张牌","减少敌方3点人口","去掉敌方一个招募卡","去掉敌方两张卡",
"减少对方7点金币5点人口","减少对方7点金币，增加自己4点金币","减少城主5点血量","抽一张招募卡","增加5点防御",
"增加5点人口","增加10点金币","增加10点金币","减少自己2点人口，减少敌方5点人口","对城市防御造成5点伤害",
"损坏敌人7点金币和3点人口");
var	cardPeople=new Array("1","2","4","3","5","0","7","2","1","3","5","4","6","2","3","5","8","7","5","1","2","0",
"0","2","0","0","0","0","0","0","0","2","0","0","0","0","0","0","0","2","0","2","2","3","0","3","0","3","0","0",
"3","0","5","0","2","2","0");
var cardMoney=new Array("0","0","0","0","0","3","0","0","0","0","0","0","0","0","0","0","10","12","10","5","5",
"10","5","5","10","10","10","10","10","10","5","2","12","10","7","3","8","4","0","3","0","0","0","8","10","0",
"0","10","0","5","0","5","10");
var cardType=new Array("近","近","近","近","近","近","近","远","远","远","远","远","远","穿","穿","穿","近","远",
"远","特","募","募","募","募","募","募","募","募","常","常","常","常","常","常","常","常","常","常","常","常",
"猛","猛","猛","谋","猛","谋","儒","智","使","使","祭","巫","道","道");

/**
 * 牌类，只用来表示牌的基本属性，不包含游戏逻辑，所有属性只读，
 * 
 * @class Card
 * @constructor
 * @param {Number} id - 
 * 
 */
function Card (cid) {
    Object.defineProperties(this, {
		
        id: {
            value: cid,
            writable: false
        },
        //
        name: {
            get: function () {
                return cardNames[cid];
            }
        },
        effect: {
            get: function () {
                return cardEffects[cid];
            }
        },
		people:{
			get: function () {
                return cardPeople[cid];
            }
		},
		money:{
			get: function () {
                return cardMoney[cid];
            }
		},
		type:{
			get: function () {
                return cardType[cid];
            }
		},
    });
}

Card.prototype.toString = function () {
    return this.id + ' ' + this.name;
};
var newcards= new Array(cardNames.length);
// 初始化
(function createCards () {
        for (var p = 0; p < cardNames.length; p++) {
            var card = new Card(p);
			
            newcards[card.id] = card;
        }
    
})();
Card.fromId = function (id) {
	console.log(newcards[id]);
	
    return newcards[id];
    
};



module.exports = {
    Card: Card,
   
};
