var cardNames =new Array("民兵","步兵","骑兵","重步兵","重骑兵","雇佣兵","骁勇骑","猎人","弓手","弩手","重弩手",
"骑兵射手","精锐骑兵射手","枪兵","长枪兵","精锐长枪兵","攻城车","投石车","单臂弩车","刺客","猛将","谋士","外交官",
"智将","大儒","大祭司","巫","道士","城市升级","军事升级","防御工事","增兵防守","守城巨弩","修缮城墙","募兵令",
"广纳贤良","游闲神医","军医","募粮令","征讨令","袭营","斩将","冲阵","火攻","截获","离间","举贤","布阵","借兵",
"借粮","祈雨","巫鼓","黄巾力士","雷公助阵");
var cardEffects =new Array("造成1点伤害","造成2点伤害","对城主造成4点伤害或损坏敌方5点金币","造成3点伤害",
"对城主造成5点伤害或损坏敌方6点金币","造成1点伤害","对城主造成7点伤害或损坏对方8点金币","造成2点伤害",
"造成1点伤害","造成3点伤害","造成4点伤害","造成2点伤害或损坏敌人1点人口","造成4点伤害或损坏2点人口",
"造成1点伤害","造成2点伤害","造成3点伤害","对城市防御造成12点伤害","造成8点伤害或损坏敌方5点人口",
"造成7点伤害","去掉对面1个特殊角色","每回合造成1点伤害，使用猛将卡 ","使用计谋卡","使用外交卡",
"每回合+1城市防御，使用智将卡","每回合+2金币和1人口","使用祭祀卡","使用巫术卡","使用道术卡","城市规模升级",
"军事规模升级","+3点城市防御","+3点城市防御","+7点城市防御","+5点城市防御","增加军事人口3点","随机给一张招募卡",
"+5点城主血量","+2点城主血量","增加5点金币","抽2张牌","减少敌方3点人口","去掉敌方一个招募卡","去掉敌方两张卡",
"减少对方7点金币5点人口","减少对方7点金币，增加自己4点金币","减少城主5点血量","抽一张招募卡","增加5点防御",
"增加5点人口","增加10点金币","增加10点金币","减少自己3点人口，减少敌方5点人口","对城市防御造成7点伤害",
"损坏敌人8点金币或3点人口");


/**
 * 牌类，只用来表示牌的基本属性，不包含游戏逻辑，所有属性只读，
 * 
 * @class Card
 * @constructor
 * @param {Number} id - 
 * 
 */
function Card (cid) {
    Object.defineProperties(this, {
		
        id: {
            value: cid,
            writable: false
        },
        //
        name: {
            get: function () {
                return cardNames[cid];
            }
        },
        effect: {
            get: function () {
                return cardEffects[cid];
            }
        },
    });
}
Card.prototype.toString = function () {
    return this.id + ' ' + this.name;
};
var newcards= new Array(cardNames.length);
// 初始化
(function createCards () {
        for (var p = 0; p < cardNames.length; p++) {
            var card = new Card(p);
			
            newcards[card.id] = card;
        }
    
})();
Card.fromId = function (id) {
	console.log(newcards[id]);
	
    return newcards[id];
    
};


module.exports = {
    Card: Card,
   
};
